Revit 2024 API
ExporterIFCUtils.GetGlobal3DOriginHandle Method
 Obtains the handle representing the 3D origin.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static IFCAnyHandle GetGlobal3DOriginHandle()
Visual Basic
Public Shared Function GetGlobal3DOriginHandle As IFCAnyHandle
Visual C++
public:
static IFCAnyHandle^ GetGlobal3DOriginHandle()
Return Value
 The handle.
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace